#include<iostream>
#include<limits.h>
#include<set>
#define N 5

#define N15 3
#define M15 3

#define N16 5
#define M16 5

using namespace std;

int main()
{
    /* 11. Програма за намиране на максималния елемент на едномерен масив, средната стойност на сумата на елементите,
     броя на нечетните и дали числото n се съдържа в отрицателните елементи на масива.

    using N
    */

//    int i, sum=0, countOdd = 0, n, a[N];
//    int maxValue = INT_MIN;
//    string isNInArray = "false";
//
//    cin >> n;
//    for(i=0; i<N; i++){
//        cout << "a[" << i << "] = ";
//        cin >> a[i];
//
//        sum += a[i];
//        if(a[i] > maxValue) maxValue = a[i];
//        if(a[i] % 2 != 0) countOdd++;
//        if(a[i] == n && a[i] < 0) isNInArray = "true";
//        }
//
//    cout << "max = " << maxValue << "\n";
//    cout << "average = " << (double) sum / N << "\n";
//    cout << "count of odd numbers : " << countOdd << "\n";
//    cout << "is n in the array : " << isNInArray << "\n";


/* 12. Съставете алгоритъм и напишете програма за преброяване на всички двойки от съседни елементи на едномерен масив,
 в които двата елемента имат различни знаци.
*/
//int a[5] = {1,2,-3,4,5};
//int count=0;
//for(int i=1; i<5; i++){
//    if(a[i-1] * a[i] < 0) count++;
//}
//cout << count;


/* 13. Съставете алгоритъм и напишете програма за намиране на произведението на всички елементи на едномерен масив,
 участващи в двойки от елементи, чиито суми са не по-големи от 120.
*/
//int a[5] = {3,2,3,4,1};
//long p = 1;
//set<int> dvoiki;
//for(int i=0; i<5; i++){
//    if(a[i] > 120) continue;
//    for(int j=i+1; j<5; j++){
//        if(a[j-1] + a[j] < 120) { dvoiki.insert(a[j-1]); dvoiki.insert(a[j]);}
//    }
//}
//for(auto& integer : dvoiki){
//    p *= integer;
//}
//cout << p;


/* 14. Съставете алгоритъм и напишете програма за намиране на броя на площадките на едномерен масив.
Площадка наричаме два или повече съседни и еднакви елемента на едномерен масив.
*/
//int i, count=0;
//bool found = false;
//int a[] = {1,1,2,3,3,3,4,4};
//int n = sizeof(a) / sizeof(int);
//for(i=0; i<n-1; i++){
//    while(a[i+1] == a[i]){
//        i++;
//        if(!found) count++;
//        if(i >= N) break;
//    }
//    found = false;
//}
//
//cout << count;


/* 15. Съставете алгоритъм и напишете програма за намиране на сумата на елементите по периметъра на двумерен масив

using N15 and M15 */
//int i, j, sum=0, a[N15][M15];
//for(i=0; i<N15; i++){
//    for(j=0; j<M15; j++){
//        cout << "a[" << i << "][" << j << "] = ";
//        cin >> a[i][j];
//    }
//}
//// right
//for(j=0; j<N15-1; j++)
//    sum += a[0][j];
//
//// down
//for(i=0; i<M15-1; i++)
//    sum += a[i][N15-1];
//
//// left
//for(j=N15-1; j>0; j--)
//    sum += a[M15-1][j];
//
//// up
//for(i=N15-1; i>0; i--)
//    sum += a[i][0];
//
//cout << sum;


/* 16. Въведете елементите на двумерен масив. Създайте едномерен масив с елементи, елементите на двумерния масив,
 както следва: сумата на елементите по главния диагонал, сумите на елементите по редове и броя на елементите под
 главния диагонал, по-малки от сумите на индексите им.

 using N16 and M16
*/
//int a[N16][M16] = {
//    {1,  2, 3,4 ,5},
//    {6,  7, 8,9, 10},
//    {11,12,13,14,15},
//    {16,17,18,19,20},
//    {21,22,23,24,25}
//};
//int b[2+N16] = {0};
//
//for(int i=0; i<N16; i++){
//    for(int j=0; j<M16; j++){
//        if(i==j) b[0] += a[i][j];
//
//        b[i+1] += a[i][j];
//
//        if(i > j) {
//            if(a[i][j] < i+j) b[1+N16]++;
//        }
//    }
//}
//
//for(int i=0; i<2+N16; i++){
//    cout << b[i] << "\n";
//}


/* 17. Въведете елементите на двумерен масив. Да се създаде едномерен масив с елементи елементите на
 двумерния масив намиращи се в интервала [x, y].
*/
//int a[3][3], b[9], x,y, index=0;
//cout << "x = ";
//cin >> x;
//
//cout << "y = ";
//cin >> y;
//
//if(y<x) swap(x,y);
//
//for(int i=0; i<3; i++){
//    for(int j=0; j<3; j++){
//        cin >> a[i][j];
//
//        if(a[i][j] >= x && a[i][j] <= y){
//            b[index++] = a[i][j];
//        }
//    }
//}
//
//for(int i=0; i<index; i++){
//    cout << b[i] << " ";
//}

/* 18. Да се състави програма, чрез която се обработват елементите на двумерен масив по следния начин:
а) всички нечетни елементи над главния диагонал да станат четни (чрез прибавяне на 1);
б) всички четни елементи под главния диагонал да станат нечетни (чрез изваждане на 1);
в) при всяка промяна съгласно условие а и б, елементът от главния диагонал в същия ред нараства с 1.

using N16 and M16 ( N16 must be equal to M16 )
*/
//int a[N16][M16];
//for(int i=0; i<N16; i++){
//    for(int j=0; j<M16; j++){
//        cin >> a[i][j];
//    }
//}
//
//for(int i=0; i<N16; i++){
//    for(int j=0; j<M16; j++){
//        if(j>i)
//            if(a[i][j] % 2 != 0){
//                a[i][j]++;
//                a[i][i]++;
//            }
//
//        if(j<i)
//            if(a[i][j] % 2 == 0){
//            a[i][j]--;
//            a[i][i]++;
//            }
//    }
//}
//
//for(int i=0; i<N16; i++){
//    for(int j=0; j<M16; j++){
//        cout << a[i][j] << " ";
//    }
//    cout << "\n";
//}


/* 19. Съставете алгоритъм и напишете програма за намиране на сумата на елементите по вторичния диагонал на двумерен масив.

using N16 */
//int a[N16][N16], sum=0;
//
//for(int i=0; i<N16; i++){
//    for(int j=0; j<N16; j++){
//        cin >> a[i][j];
//
//        if(i+j == N16-1) sum += a[i][j];
//    }
//}
//
//cout << "sum " << sum;


/* 20. Даден е двумерен масив. Чрез въвеждане на уникален индекс да се изведе съответния елемент на масива. */
//int a[][3] = {1,2,3,4,5,6,7,8,9};
//
//int i,j;
//cout << "i = ";
//cin >> i;
//cout << "j = ";
//cin >> j;
//
//if(a[0] == NULL) return 0;
//if(i >= ((sizeof(a) / sizeof(int))) / (sizeof(a[0]) / sizeof(int)) ) {cout << "Out of bound i"; return 0;}
//if(j >= sizeof(a[0]) / sizeof(int)) {cout << "Out of bound j"; return 0;}
//
//cout << "a[" << i << "][" << j << "] = " << a[i][j];

	return 0;
}
